Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/katafc/go-httpd/target_count_5/repeat_11/1.txt
2020/01/26 20:01:11 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8001/
2020/01/26 20:01:42 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Completed 100000 requests
Finished 184353 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8001
Document Path:          /
Document Length:        26 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      184353
Failed requests:        0
Total transferred:      26362479 bytes
HTML transferred:       4793178 bytes
Requests per second:    6145.07 [#/sec] (mean)
Time per request:       16.273 [ms] (mean)
Time per request:       0.163 [ms] (mean, across all concurrent requests)
Transfer rate:          858.15 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  20.7      1    1024
Processing:     0   13  17.8     10     401
Waiting:        0   12  17.5     10     400
Total:          0   16  27.8     11    1257
Percentage of the requests served within a certain time (ms)
  50%     11
  66%     13
  75%     16
  80%     18
  90%     26
  95%     33
  98%     56
  99%    108
 100%   1257 (longest request)
2020/01/26 20:01:42 Matched stat line [Connect:        0    4  20.7      1    1024 Connect 0 4 20.7 1 1024]
2020/01/26 20:01:42 Matched stat line [Processing:     0   13  17.8     10     401 Processing 0 13 17.8 10 401]
2020/01/26 20:01:42 Matched stat line [Waiting:        0   12  17.5     10     400 Waiting 0 12 17.5 10 400]
2020/01/26 20:01:42 Matched stat line [Total:          0   16  27.8     11    1257 Total 0 16 27.8 11 1257]
2020/01/26 20:01:42 Matched percentline [  50%     11 50 11]
2020/01/26 20:01:42 Matched percentline [  66%     13 66 13]
2020/01/26 20:01:42 Matched percentline [  75%     16 75 16]
2020/01/26 20:01:42 Matched percentline [  80%     18 80 18]
2020/01/26 20:01:42 Matched percentline [  90%     26 90 26]
2020/01/26 20:01:42 Matched percentline [  95%     33 95 33]
2020/01/26 20:01:42 Matched percentline [  98%     56 98 56]
2020/01/26 20:01:42 Matched percentline [  99%    108 99 108]
2020/01/26 20:01:42 Matched percentline [ 100%   1257 100 1257]
{"connect":{"max":1024,"mean":4,"median":1,"min":0,"stdDev":20.700000762939453},"percentiles":{"100":1257,"50":11,"66":13,"75":16,"80":18,"90":26,"95":33,"98":56,"99":108},"processing":{"max":401,"mean":13,"median":10,"min":0,"stdDev":17.799999237060547},"total":{"max":1257,"mean":16,"median":11,"min":0,"stdDev":27.799999237060547},"waiting":{"max":400,"mean":12,"median":10,"min":0,"stdDev":17.5}}